Тест1/src/Catalogs/МодельТС/МодельТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МодельТС</name>
  <owners>Catalog.ТипТС</owners>
  <tabularSections>
    <name>ПлановыеРемонты</name>
    <attributes>
      <name>ВидОбслуживания</name>
      <type>
        <types>CatalogRef.ВидыОбслуживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПланированияПоВыработке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>EnumRef.ПараметрыВыработкиАтомобиля</types>
      </type>
    </attributes>
    <attributes>
      <name>Допуск</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПовторов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Enums/ПараметрыВыработкиАтомобиля/ПараметрыВыработкиАтомобиля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПараметрыВыработкиАтомобиля</name>
  <enumValues>
    <name>Пробег</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Catalogs/МодельТС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПлановыеРемонты

&НаКлиенте
Процедура ПлановыеРемонтыВидПланированияПоВыработкеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПлановыеРемонты.ТекущиеДанные;
	Если ТекущиеДанные.ВидПланированияПоВыработке Тогда
		ТекущиеДанные.ПараметрВыработки = ПредопределенноеЗначение("Перечисление.ПараметрыВыработкиАтомобиля.Пробег");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьУсловноеОформление()

	// видимость полей, зависимых от вида планирования
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПлановыеРемонтыПериодичность");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.ПлановыеРемонты.ВидПланированияПоВыработке", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПлановыеРемонтыПараметрВыработки");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПлановыеРемонтыДопуск");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.ПлановыеРемонты.ВидПланированияПоВыработке", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	
КонецПроцедуры // УстановитьУсловноеОформление()


#КонецОбласти
